In [9]:
# joins
import os
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
os.getcwd()
os.chdir('E:\\Jaishree\\Data Science with Python\\Datasets')

In [10]:
North = pd.read_csv('North.csv',sep =',', header =0)
East = pd.read_csv('East.csv',sep =',', header =0)
West = pd.read_csv('West.csv',sep =',', header =0)
print(North.head())
print(East.head())
print(West.head())
print(North.shape)
print(East.shape)
print(West.shape)

  SalesId First Name Last Name Sales Date  Total Sales Amt Region
0   XN458      Harry     White  18-Dec-10             6000  North
1   XN209     Nathan   Masters   4-Apr-10            21000  North
2   XN209     Nathan   Masters  21-Mar-10             5900  North
3   XN865    Charlie       May   5-Dec-10            12000  North
4   XN458      Harry     White  16-Oct-10            17000  North
  SalesId First Name Last Name Sales Date  Total Sales Amt Region
0   XE908       Alan     Hyman  20-Jun-10            19000   East
1   XE856      Miles  Lassiter  15-May-10            43000   East
2   XE435    Richard   Darlene  12-Sep-10            21000   East
3   XE908       Alan     Hyman   3-Nov-10             5600   East
4   XE346      Manny     Lines   1-Apr-10            21000   East
  SalesId First Name Last Name Sales Date  Total Sales Amt Region
0   XW567       Mike   Kinsley  12-Aug-10            19000   West
1   XW345        Sid      Hale  12-Jul-10            21000   West
2   XW785         Ed    Berndt   1-Mar-10            31000   West
3   XW345        Sid      Hale  19-Sep-10            15000   West
4   XW346        Ben     Britt  31-Jan-10             9000   West
(14, 6)
(14, 6)
(14, 6)

In [11]:
# Concatenating 
# Concatenating is nothing but stacking the data. 
# To stack dataframes, we use the concat method in the pandas module.
# We simply append the rows from the second dataset to the rows of the first dataset.
NorthEastWest = pd.concat([North,East,West])
print(NorthEastWest.head())
print(NorthEastWest.shape)

  SalesId First Name Last Name Sales Date  Total Sales Amt Region
0   XN458      Harry     White  18-Dec-10             6000  North
1   XN209     Nathan   Masters   4-Apr-10            21000  North
2   XN209     Nathan   Masters  21-Mar-10             5900  North
3   XN865    Charlie       May   5-Dec-10            12000  North
4   XN458      Harry     White  16-Oct-10            17000  North
(42, 6)

In [20]:
# Merging
dj1 = pd.read_csv('dj1.csv',sep =',', header =0)
dj2 = pd.read_csv('dj2.csv',sep =',', header =0)
print(dj1.head())
print(dj1.shape)
print(dj2.head())
print(dj2.shape)

   Customer_ID  Product
0            1  Toaster
1            2  Toaster
2            3  Toaster
3            4    Radio
4            5    Radio
(6, 2)
   Customer_ID    State
0            2  Alabama
1            4  Alabama
2            6     Ohio
(3, 2)

In [ ]:
# Outer Join
pd.merge(dj1,dj2, how="outer", on='Customer_ID')

In [ ]:
# Inner Join
pd.merge(dj1,dj2, how="inner", on='Customer_ID')
# Sometimes, the common column may not be the same.
# One way to merge the two data frames now is to probably rename this customer ID to a common name or 
# we can use the left_on and right_on options to specify the columns
# that are to be treated as common column in the merge method.

In [21]:
# handling dates
Fd = pd.read_csv('Fd.csv',sep =',', header =0)
print(Fd.head())
print(Fd.shape)
print(Fd.info())

  FlightDate UniqueCarrier  AirlineID Carrier TailNum  FlightNum  \
0  01-Jan-14            DL      19790      DL  N948DN        335
1  01-Jan-14            DL      19790      DL  N925DN       1095
2  01-Jan-14            DL      19790      DL  N921DN       2422
3  01-Jan-14            DL      19790      DL  N937DN       1607
4  01-Jan-14            US      20355      US  N668AW        657

   OriginAirportID  OriginAirportSeqID  OriginCityMarketID Origin    ...      \
0            11057             1105703               31057    CLT    ...
1            11057             1105703               31057    CLT    ...
2            11057             1105703               31057    CLT    ...
3            11057             1105703               31057    CLT    ...
4            11057             1105703               31057    CLT    ...

  DestAirportID DestAirportSeqID  DestCityMarketID Dest  DestCityName  \
0         10397          1039705             30397  ATL   Atlanta, GA
1         10397          1039705             30397  ATL   Atlanta, GA
2         10397          1039705             30397  ATL   Atlanta, GA
3         10397          1039705             30397  ATL   Atlanta, GA
4         10397          1039705             30397  ATL   Atlanta, GA

   DestState  DestStateFips  DestStateName DestWac CRSDepTime
0         GA             13        Georgia      34       1700
1         GA             13        Georgia      34       1315
2         GA             13        Georgia      34        945
3         GA             13        Georgia      34        710
4         GA             13        Georgia      34       1310

[5 rows x 25 columns]
(30443, 25)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30443 entries, 0 to 30442
Data columns (total 25 columns):
FlightDate            30443 non-null object
UniqueCarrier         30443 non-null object
AirlineID             30443 non-null int64
Carrier               30443 non-null object
TailNum               30017 non-null object
FlightNum             30443 non-null int64
OriginAirportID       30443 non-null int64
OriginAirportSeqID    30443 non-null int64
OriginCityMarketID    30443 non-null int64
Origin                30443 non-null object
OriginCityName        30443 non-null object
OriginState           30443 non-null object
OriginStateFips       30443 non-null int64
OriginStateName       30443 non-null object
OriginWac             30443 non-null int64
DestAirportID         30443 non-null int64
DestAirportSeqID      30443 non-null int64
DestCityMarketID      30443 non-null int64
Dest                  30443 non-null object
DestCityName          30443 non-null object
DestState             30443 non-null object
DestStateFips         30443 non-null int64
DestStateName         30443 non-null object
DestWac               30443 non-null int64
CRSDepTime            30443 non-null int64
dtypes: int64(13), object(12)
memory usage: 5.8+ MB
None

In [22]:
# To do any manipulations on date we will first have to convert the date
# into a uniform date time format, 
# using the to_datetime method from Pandas library.
# The to_datetime method returns a pandas series that can be manipulated over.
Fd['FlightDate']= pd.to_datetime(Fd['FlightDate'],format="%d-%b-%y")

In [ ]:
Fd.info()

In [25]:
Fd['Month']=pd.DatetimeIndex(Fd['FlightDate']).month
# The month as January=1, December=12

In [26]:
Fd.head()

,FlightDate,UniqueCarrier,AirlineID,Carrier,TailNum,FlightNum,OriginAirportID,OriginAirportSeqID,OriginCityMarketID,Origin,...,DestAirportSeqID,DestCityMarketID,Dest,DestCityName,DestState,DestStateFips,DestStateName,DestWac,CRSDepTime,Month
0,2014-01-01,DL,19790,DL,N948DN,335,11057,1105703,31057,CLT,...,1039705,30397,ATL,"Atlanta, GA",GA,13,Georgia,34,1700,1
1,2014-01-01,DL,19790,DL,N925DN,1095,11057,1105703,31057,CLT,...,1039705,30397,ATL,"Atlanta, GA",GA,13,Georgia,34,1315,1
2,2014-01-01,DL,19790,DL,N921DN,2422,11057,1105703,31057,CLT,...,1039705,30397,ATL,"Atlanta, GA",GA,13,Georgia,34,945,1
3,2014-01-01,DL,19790,DL,N937DN,1607,11057,1105703,31057,CLT,...,1039705,30397,ATL,"Atlanta, GA",GA,13,Georgia,34,710,1
4,2014-01-01,US,20355,US,N668AW,657,11057,1105703,31057,CLT,...,1039705,30397,ATL,"Atlanta, GA",GA,13,Georgia,34,1310,1

In [27]:
print(pd.DatetimeIndex(Fd['FlightDate']).dayofweek)
# The day of the week with Monday=0, Sunday=6
print(pd.DatetimeIndex(Fd['FlightDate']).weekday_name)

Int64Index([2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
            ...
            5, 5, 5, 5, 5, 5, 5, 5, 5, 5],
           dtype='int64', name='FlightDate', length=30443)
Index(['Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday',
       'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday',
       ...
       'Saturday', 'Saturday', 'Saturday', 'Saturday', 'Saturday', 'Saturday',
       'Saturday', 'Saturday', 'Saturday', 'Saturday'],
      dtype='object', name='FlightDate', length=30443)

In [28]:
# Add a duration
Fd['FlightDate']+pd.to_timedelta(365,unit='D')

0       2015-01-01
1       2015-01-01
2       2015-01-01
3       2015-01-01
4       2015-01-01
5       2015-01-01
6       2015-01-01
7       2015-01-01
8       2015-01-01
9       2015-01-01
10      2015-01-01
11      2015-01-01
12      2015-01-01
13      2015-01-01
14      2015-01-01
15      2015-01-01
16      2015-01-01
17      2015-01-01
18      2015-01-01
19      2015-01-01
20      2015-01-01
21      2015-01-01
22      2015-01-01
23      2015-01-01
24      2015-01-01
25      2015-01-01
26      2015-01-01
27      2015-01-01
28      2015-01-01
29      2015-01-01
           ...
30413   2015-03-15
30414   2015-03-15
30415   2015-03-15
30416   2015-03-15
30417   2015-03-15
30418   2015-03-15
30419   2015-03-15
30420   2015-03-15
30421   2015-03-15
30422   2015-03-15
30423   2015-03-15
30424   2015-03-15
30425   2015-03-15
30426   2015-03-15
30427   2015-03-15
30428   2015-03-15
30429   2015-03-15
30430   2015-03-15
30431   2015-03-15
30432   2015-03-15
30433   2015-03-15
30434   2015-03-15
30435   2015-03-15
30436   2015-03-15
30437   2015-03-15
30438   2015-03-15
30439   2015-03-15
30440   2015-03-15
30441   2015-03-15
30442   2015-03-15
Name: FlightDate, Length: 30443, dtype: datetime64[ns]

In [ ]:
Sunday = Fd[(pd.DatetimeIndex(Fd['FlightDate']).dayofweek) == 6]
Sunday.groupby('DestCityName').agg({'DestCityName':np.size})

In [31]:
# Date Arithmatic
# The datetime module supplies classes for 
# manipulating dates and times in both simple and complex ways. 
import datetime as dt
from datetime import date
now = date.today()
print(now)
now = pd.to_datetime(now,format="%Y-%m-%d")
print(now-Fd['FlightDate'])

2018-10-07
0       1740 days
1       1740 days
2       1740 days
3       1740 days
4       1740 days
5       1740 days
6       1740 days
7       1740 days
8       1740 days
9       1740 days
10      1740 days
11      1740 days
12      1740 days
13      1740 days
14      1740 days
15      1740 days
16      1740 days
17      1740 days
18      1740 days
19      1740 days
20      1740 days
21      1740 days
22      1740 days
23      1740 days
24      1740 days
25      1740 days
26      1740 days
27      1740 days
28      1740 days
29      1740 days
           ...
30413   1667 days
30414   1667 days
30415   1667 days
30416   1667 days
30417   1667 days
30418   1667 days
30419   1667 days
30420   1667 days
30421   1667 days
30422   1667 days
30423   1667 days
30424   1667 days
30425   1667 days
30426   1667 days
30427   1667 days
30428   1667 days
30429   1667 days
30430   1667 days
30431   1667 days
30432   1667 days
30433   1667 days
30434   1667 days
30435   1667 days
30436   1667 days
30437   1667 days
30438   1667 days
30439   1667 days
30440   1667 days
30441   1667 days
30442   1667 days
Name: FlightDate, Length: 30443, dtype: timedelta64[ns]

In [ ]:
# Working with Strings
# Change to Upper Case
Fd['DestCityName'].str.upper()

In [ ]:
# Change to proper case
Fd['DestCityName'].str.capitalize()

In [ ]:
Fd['DestCityName'].str.count('GA')

In [ ]:
Fd['DestCityName'].str.replace('GA','AG')

In [ ]:
# Handling missing values 
# Finding the number of missing values
Expenses = pd.read_csv('expenses.csv',sep =',', header =0)
Expenses.head()

In [36]:
Expenses.isnull().sum()

age         0
sex         0
bmi         2
children    0
smoker      0
region      0
charges     0
dtype: int64

In [ ]:
Expenses.describe()

In [ ]:
# To remove missing values
Expmiss = Expenses.copy()
print(Expmiss[Expmiss['bmi'].isnull() == True])
missing = Expmiss[Expmiss['bmi'].isnull() == True].index
print(missing)

In [ ]:
Expmiss.drop(missing, inplace=True)

In [ ]:
Expmiss.describe()

In [ ]:
# Alternate way to drop rows where there is at least one NA.
# Expmiss.dropna(axis=0,inplace=True)
# axis=0 for rows, 1 for columns, default 0

In [ ]:
# Imputing individual column missing values with mean
Expimpute = Expenses.copy()
Expimpute['bmi'] = Expimpute['bmi'].fillna(np.mean(Expimpute['bmi']))
print(Expimpute.iloc[[16,17],:])
Expimpute.describe()

In [37]:
# Handling Outliers
Expenses.describe()

               age          bmi     children       charges
count  1338.000000  1336.000000  1338.000000   1338.000000
mean     39.310912    30.668413     1.094918  13270.422265
std      14.185613     6.099896     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.308750     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.700000     2.000000  16639.912515
max      95.000000    53.130000     5.000000  63770.428010

In [ ]:
print(np.percentile(Expenses['age'],90))
print(np.percentile(Expenses['age'],95))
print(np.percentile(Expenses['age'],99))
Expenses[Expenses['age']> 64]

In [ ]:
# Replacing Outliers with 99th percentile
rownum = Expenses[Expenses['age']> 64].index
Expenses.loc[rownum,'age'] = 64
Expenses.describe()